EDT/УТ/src/Documents/РейсТест/РейсТест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РейсТест</name>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТипыТранспортовВероут</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсМестнойДоставки</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>axi_Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытиеРейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_РаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </attributes>
  <attributes>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасположения</name>
      <type>
        <types>EnumRef.ТипыРасположенияТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяВремяОтправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеРасстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапланированнаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяУбытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.СтатусыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказа</name>
      <type>
        <types>EnumRef.ВидыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВРучную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзВероут</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяМаршрутизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поездки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоездки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДистанция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяПродолжительностьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяНачалаПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяОкончанияПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПривязкаМашинКРейсам/ПривязкаМашинКРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПривязкаМашинКРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанВодитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанЭкспедитор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КтоПривязал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ФиксацияВеса/ФиксацияВеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФиксацияВеса</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Весы</name>
    <type>
      <types>CatalogRef.ЭлектронныеВесы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоЗаказа</name>
    <type>
      <types>CatalogRef.МестаПоЗаказам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СостоянияЗаказов/СостоянияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Экспедитор_КУдалению</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>Водитель_КУдалению</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>СторонаПретензий</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваров</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияУслуг</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезналичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваровНДС</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОплатыНаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/РейсТест/Forms/ВыборПериода_МаршрутныйЛист/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	ТабДок = ПечатьМаршрутныхЛистовНаСервере();	
	ТабДок.Показать();
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Период.ДатаНачала = НачалоДня(ТекущаяДата());
    Период.ДатаОкончания = КонецДня(ТекущаяДата());
	Дата = ТекущаяДата();
КонецПроцедуры


Функция ПечатьМаршрутногоЛистаСервер(РейсСсылка, ТабличныйДокумент)

	Макет = Документы.Рейс.ПолучитьМакет("МаршрутныйЛист_Горизонтальный");
	//ТабличныйДокумент = Новый ТабличныйДокумент;	
	
	//ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаЗаголовок = Макет.ПолучитьОбласть("СтрокаЗаголовок");	
    ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЗаказ");
	ОбластьЗабор = Макет.ПолучитьОбласть("СтрокаЗабор");
	ОбластьТекст = Макет.ПолучитьОбласть("Текст2");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьАвтоНадЗаголовком = Макет.ПолучитьОбласть("АвтоНадЗаголовком");
	ОбластьКолонтитул = Макет.ПолучитьОбласть("Колонтитул");
	

	МассивОбластей = Новый Массив;
	
	// шапка
	ЗапросПоРейсу = Новый Запрос("ВЫБРАТЬ
	                             |	ПривязкаМашинКРейсамСрезПоследних.Период,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Рейс,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Транспорт,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Водитель,
	                             |	ПривязкаМашинКРейсамСрезПоследних.Экспедитор,
	                             |	ПривязкаМашинКРейсамСрезПоследних.КтоПривязал
	                             |ИЗ
	                             |	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	                             |ГДЕ
	                             |	ПривязкаМашинКРейсамСрезПоследних.Рейс = &Рейс");
	ЗапросПоРейсу.УстановитьПараметр("Рейс", РейсСсылка);	
	РезРейс = ЗапросПоРейсу.Выполнить().Выбрать();
	Если РезРейс.Следующий() Тогда		
		МаркаАвто = РезРейс.Транспорт.Марка;
		ГосНомер  = РезРейс.Транспорт.НомерГосударственнойРегистрации;
		ОбластьШапка.Параметры.ДанныеРейса = "Водитель: " + РезРейс.Водитель + Символы.ПС 
		+ ?(ЗначениеЗаполнено(РезРейс.Экспедитор), "Экспедитор: " + РезРейс.Экспедитор + Символы.ПС, ""); 
		//+ "Авто: " + МаркаАвто + ", " + ГосНомер;
	КонецЕсли;
	
	НомерМаршрута = РейсСсылка.НомерПалетты;
	
	//ОбластьШапка.Параметры.ТекущееВремя = ТекущаяДата();
	
	КолЗаказов = 0;
	КолЗаборов = 0;    
	КолКредитныхДоговоров = 0;
	КолБезнальныхДокументов	= 0;
	
	//+++ БАО 25.05.2017 №900
	КолЛореальВ2В = 0;
	
	ЛореальВ2В = Справочники.Контрагенты.НайтиПоКоду("Shop_680");
	//--- БАО 25.05.2017 №900

	
	DirectCredit = Справочники.Контрагенты.НайтиПоКоду("Shop_234");
	DirectCredit_Папка = Справочники.Контрагенты.НайтиПоКоду("Shop_1000");
	Poscredit = Справочники.Контрагенты.НайтиПоКоду("Shop_391");
	
	
	ЗапросЗаказы = Новый Запрос("ВЫБРАТЬ
	                            |	РейсЗаказы.Ссылка КАК Ссылка,
	                            |	РейсЗаказы.НомерСтроки КАК НомерСтроки,
	                            |	РейсЗаказы.НомерПоездки КАК НомерПоездки,
	                            |	РейсЗаказы.СтатусЗаказа КАК СтатусЗаказа,
	                            |	РейсЗаказы.ВидЗаказа КАК ВидЗаказа,
	                            |	РейсЗаказы.ПродолжительностьОперации КАК ПродолжительностьОперации,
	                            |	РейсЗаказы.Заказ КАК Заказ,
	                            |	РейсЗаказы.Объем КАК Объем,
	                            |	РейсЗаказы.Вес КАК Вес,
	                            |	РейсЗаказы.ЗаказДобавленВРучную КАК ЗаказДобавленВРучную,
	                            |	РейсЗаказы.УдаленИзРейса КАК УдаленИзРейса,
	                            |	РейсЗаказы.ЗагруженИзВероут КАК ЗагруженИзВероут,
	                            |	РейсЗаказы.Заказ.ТипОплаты КАК ТипОплаты,
	                            |	ВЫБОР
	                            |		КОГДА РейсЗаказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	                            |			ТОГДА ""Доставка""
	                            |		ИНАЧЕ ""Забор""
	                            |	КОНЕЦ КАК ТипЗаказа,
								//+++ БАО 25.05.2017 №900
								|	РейсЗаказы.Заказ.Контрагент КАК Контрагент,
								//--- БАО 25.05.2017 №900
	                            |	РейсЗаказы.Заказ.ВладелецТовара КАК ВладелецТовара,
	                            |	РейсЗаказы.Заказ.ВладелецТовара.Родитель КАК ВладелецТовараРодитель
	                            |ИЗ
	                            |	Документ.Рейс.Заказы КАК РейсЗаказы
	                            |ГДЕ
	                            |	РейсЗаказы.Ссылка = &Ссылка
	                            |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ");
	ЗапросЗаказы.УстановитьПараметр("Ссылка", РейсСсылка);
	РезЗаказы = ЗапросЗаказы.Выполнить().Выбрать();
	
	Пока РезЗаказы.Следующий() Цикл	
		Если РезЗаказы.ТипЗаказа = "Доставка" Тогда				
			КолЗаказов = КолЗаказов + 1;
			
			//кредитные договоры
			Если РезЗаказы.ТипОплаты = 2 ИЛИ РезЗаказы.ВладелецТовара = DirectCredit ИЛИ РезЗаказы.ВладелецТовара = Poscredit ИЛИ РезЗаказы.ВладелецТовараРодитель = DirectCredit_Папка Тогда			
				КолКредитныхДоговоров = КолКредитныхДоговоров + 1;			
			КонецЕсли;
			
			//безнальные документы
			Если РезЗаказы.ТипОплаты = 4 Тогда			
				КолБезнальныхДокументов = КолБезнальныхДокументов + 1;			
			КонецЕсли;
			
			//+++ БАО 25.05.2017 №900
			Если РезЗаказы.ВладелецТовара = ЛореальВ2В Тогда
				КолЛореальВ2В = КолЛореальВ2В + 1;	
			КонецЕсли;	
			//--- БАО 25.05.2017 №900

			
		ИначеЕсли РезЗаказы.ТипЗаказа = "Забор" Тогда			
			КолЗаборов = КолЗаборов + 1;
			
			//+++ БАО 25.05.2017 №900
			Если РезЗаказы.Контрагент = ЛореальВ2В Тогда
				КолЛореальВ2В = КолЛореальВ2В + 1;	
			КонецЕсли;	
			//--- БАО 25.05.2017 №900

		КонецЕсли;	
		

		
	КонецЦикла;
	
	
	//Для каждого ЗакСтр Из РейсСсылка.Заказы Цикл	
	//	Если НЕ ЗакСтр.УдаленИзРейса Тогда			
	//		Если ТипЗнч(ЗакСтр.Заказ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда				
	//			КолЗаказов = КолЗаказов + 1;
	//			
	//			//кредитные договоры
	//			Если ЗакСтр.Заказ.ТипОплаты = 2 ИЛИ ЗакСтр.Заказ.ВладелецТовара = DirectCredit ИЛИ ЗакСтр.Заказ.ВладелецТовара = Poscredit ИЛИ ЗакСтр.Заказ.ВладелецТовара.Родитель = DirectCredit_Папка Тогда			
	//				КолКредитныхДоговоров = КолКредитныхДоговоров + 1;			
	//			КонецЕсли;
	//			
	//			//безнальные документы
	//			Если ЗакСтр.Заказ.ТипОплаты = 4 Тогда			
	//				КолБезнальныхДокументов = КолБезнальныхДокументов + 1;			
	//			КонецЕсли;
	//			
	//		ИначеЕсли ТипЗнч(ЗакСтр.Заказ) = Тип("ДокументСсылка.ЗаборТовара") Тогда			
	//			КолЗаборов = КолЗаборов + 1;		
	//		КонецЕсли;	
	//	КонецЕсли;		
	//КонецЦикла;
	
	ОбластьШапка.Параметры.НомерМаршрута = НомерМаршрута;
	ОбластьШапка.Параметры.КолЗаказов = КолЗаказов;
	ОбластьШапка.Параметры.КолЗаборов = КолЗаборов;	
	ОбластьШапка.Параметры.Штрихкод = lem.глСформироватьБарКодEAN13(ОбщегоНазначения.СформироватьШтрихкодРейса(РейсСсылка));
	
	//ТабличныйДокумент.Вывести(ОбластьШапка);
	//МассивОбластей.Добавить(ОбластьШапка);
	//ТабличныйДокумент.Вывести(ОбластьСтрокаЗаголовок);
	//МассивОбластей.Добавить(ОбластьСтрокаЗаголовок);
	
	// строки заказов
	НПП = 1;
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	РейсЗаказы.НомерПоездки КАК НомерПоездки,
	                      |	""З"" КАК ТипЗаказа,
	                      |	РейсЗаказы.Заказ.Номер КАК Номер,
	                      |	РейсЗаказы.Заказ.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	                      |	РейсЗаказы.Заказ.Телефон КАК Телефон,
	                      |	РейсЗаказы.Заказ.АдресДоставки КАК АдресДоставки,
	                      |	РейсЗаказы.Заказ.ВремяДоставкиС КАК ИнтервалС,
	                      |	РейсЗаказы.Заказ.ВремяДоставкиПо КАК ИнтервалПо,
	                      |	РейсЗаказы.Заказ.ТипОплаты КАК ТипОплаты,
	                      |	РейсЗаказы.Заказ.СуммаДокумента КАК СуммаДокумента,
	                      |	РейсЗаказы.Заказ.ВесЗабора КАК Вес,
	                      |	ВЫБОР
	                      |		КОГДА РейсЗаказы.Заказ.Контрагент.Родитель.ОсновнойМагазин ЕСТЬ NULL
	                      |				ИЛИ РейсЗаказы.Заказ.Контрагент.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА РейсЗаказы.Заказ.Контрагент
	                      |		ИНАЧЕ РейсЗаказы.Заказ.Контрагент.Родитель.ОсновнойМагазин
	                      |	КОНЕЦ КАК Партнер,
	                      |	NULL КАК КоличествоМест,
	                      |	РейсЗаказы.Заказ.Грузополучатель КАК Грузополучатель,
	                      |	NULL КАК ИнтервалДоставкиСтрокой,
	                      |	РейсЗаказы.Заказ КАК Заказ,
	                      |	РейсЗаказы.НомерСтроки КАК НомерСтроки,
	                      |	РейсЗаказы.Заказ.ОбъемЗабора КАК ОбъемЗабора
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Документ.Рейс.Заказы КАК РейсЗаказы
	                      |ГДЕ
	                      |	РейсЗаказы.Заказ ССЫЛКА Документ.ЗаборТовара
	                      |	И РейсЗаказы.Ссылка.Ссылка = &Ссылка
	                      |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РейсЗаказы.НомерПоездки,
	                      |	""Д"",
	                      |	РейсЗаказы.Заказ.Номер,
	                      |	РейсЗаказы.Заказ.НомерВнешнегоЗаказа,
	                      |	РейсЗаказы.Заказ.Телефон,
	                      |	РейсЗаказы.Заказ.АдресДоставки,
	                      |	новаМестнаяДоставка.ВремяПрибытияС,
	                      |	новаМестнаяДоставка.ВремяПрибытияПо,
	                      |	РейсЗаказы.Заказ.ТипОплаты,
	                      |	РейсЗаказы.Заказ.СуммаДокумента,
	                      |	ВЫБОР
	                      |		КОГДА НЕ Накладная003Заказы.Вес ЕСТЬ NULL
	                      |				И Накладная003Заказы.Вес > 0
	                      |			ТОГДА Накладная003Заказы.Вес
	                      |		ИНАЧЕ РейсЗаказы.Заказ.ОбщийВес
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА РейсЗаказы.Заказ.ВладелецТовара.Родитель.ОсновнойМагазин ЕСТЬ NULL
	                      |				ИЛИ РейсЗаказы.Заказ.ВладелецТовара.Родитель.ОсновнойМагазин = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |			ТОГДА РейсЗаказы.Заказ.ВладелецТовара
	                      |		ИНАЧЕ РейсЗаказы.Заказ.ВладелецТовара.Родитель.ОсновнойМагазин
	                      |	КОНЕЦ,
	                      |	РейсЗаказы.Заказ.КоличествоМест,
	                      |	РейсЗаказы.Заказ.Грузополучатель,
	                      |	новаМестнаяДоставка.ИнтервалДоставкиСтрокой,
	                      |	РейсЗаказы.Заказ,
	                      |	РейсЗаказы.НомерСтроки,
	                      |	NULL
	                      |ИЗ
	                      |	Документ.Рейс.Заказы КАК РейсЗаказы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	                      |		ПО РейсЗаказы.Заказ.Номер = новаМестнаяДоставка.Номер
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	                      |		ПО РейсЗаказы.Заказ = Накладная003Заказы.Заказ
	                      |			И (Накладная003Заказы.Ссылка.Проведен)
	                      |ГДЕ
	                      |	РейсЗаказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	                      |	И РейсЗаказы.Ссылка.Ссылка = &Ссылка
	                      |	И РейсЗаказы.УдаленИзРейса = ЛОЖЬ
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Заказ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.НомерПоездки КАК НомерПоездки,
	                      |	ВТ.ТипЗаказа КАК ТипЗаказа,
	                      |	ВТ.Номер КАК Номер,
	                      |	ВТ.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	                      |	ВТ.Телефон КАК Телефон,
	                      |	ВТ.АдресДоставки КАК АдресДоставки,
	                      |	ЧАС(ВТ.ИнтервалС) КАК ИнтервалС,
	                      |	ЧАС(ВТ.ИнтервалПо) КАК ИнтервалПо,
	                      |	ВТ.ТипОплаты КАК ТипОплатыЧисло,
	                      |	ВЫБОР
	                      |		КОГДА ПараметрыКонтрагентовСрезПоследних.ПриёмИтогоСКлиента
	                      |			ТОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.КОплатеКлиентом, 0)
	                      |		ИНАЧЕ ВТ.СуммаДокумента
	                      |	КОНЕЦ КАК СуммаДокумента2,
	                      |	ВТ.Вес КАК Вес,
	                      |	ВТ.Партнер КАК Партнер,
	                      |	ВТ.КоличествоМест КАК КоличествоМест,
	                      |	ВТ.Грузополучатель КАК Грузополучатель,
	                      |	ВТ.ИнтервалДоставкиСтрокой КАК ИнтервалДоставкиСтрокой,
	                      |	ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.ЗапретЧастичногоВыкупа, ЛОЖЬ) КАК ЗапретЧастичногоВыкупа,
	                      |	ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.ЗапретСменыОплаты, ЛОЖЬ) КАК ЗапретСменыОплаты,
	                      |	ТипыОплат.Ссылка КАК ТипОплаты,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.СОжиданием, ЛОЖЬ)
	                      |			ТОГДА ""С вскрытием""
	                      |		ИНАЧЕ ""Без вскрытия""
	                      |	КОНЕЦ КАК СОжиданием,
	                      |	ЕСТЬNULL(ВложенныйЗапрос.НашВес, 0) КАК НашВес,
	                      |	ВТ.НомерСтроки КАК НомерСтроки,
	                      |	КатегорииДоставки2014.Родитель КАК КатегорияДоставки,
	                      |	ВозвратТоваровОтПокупателя.Ссылка КАК Возврат,
	                      |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП КАК КатегорияДляРасчетаЗП,
	                      |	ЕСТЬNULL(ВложенныйЗапрос1.ВесПотоварный, 0) КАК ВесПотоварный,
	                      |	ВТ.Заказ.ПредоплатаПоКредиту КАК ПредоплатаПоКредиту,
	                      |	ВТ.Заказ КАК Заказ,
	                      |	ВЫБОР
	                      |		КОГДА ВТ.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	                      |			ТОГДА ВЫБОР
	                      |					КОГДА ВТ.Заказ.УчитыватьИтогоКОплате
	                      |						ТОГДА ЕСТЬNULL(ДополнительныеПараметрыЗаказа.КОплатеКлиентом, 0)
	                      |					ИНАЧЕ ВТ.СуммаДокумента
	                      |				КОНЕЦ
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК СуммаДокумента,
	                      |	ВЫБОР
	                      |		КОГДА ВТ.Заказ ССЫЛКА Документ.ЗаборТовара
	                      |			ТОГДА ВТ.Заказ.Контрагент
	                      |		ИНАЧЕ ВТ.Заказ.ВладелецТовара
	                      |	КОНЕЦ КАК ВладелецТовара,
	                      |	ЕСТЬNULL(ВложенныйЗапрос2.Поездки, 0) + 1 КАК Поездки,
	                      |	ВложенныйЗапрос1.Сумма КАК СуммаПоТоварам,
	                      |	ВТ.ОбъемЗабора КАК ОбъемЗабора,
	                      |	ДополнительныеПараметрыЗаказа.КатегорияДляРасчетаЗП_Миго КАК КатегорияДляРасчетаЗП_Миго
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	                      |		ПО ВТ.Партнер = ПараметрыКонтрагентовСрезПоследних.Контрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	                      |		ПО ВТ.ТипОплаты = ТипыОплат.Код
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	                      |		ПО ВТ.Заказ = ДополнительныеПараметрыЗаказа.Заказ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			СУММА(ЕСТЬNULL(ФиксацияВесаСрезПоследних.Вес, 0)) КАК НашВес,
	                      |			ФиксацияВесаСрезПоследних.Заказ КАК Заказ
	                      |		ИЗ
	                      |			РегистрСведений.ФиксацияВеса.СрезПоследних(
	                      |					,
	                      |					Заказ В
	                      |						(ВЫБРАТЬ
	                      |							ВТ.Заказ
	                      |						ИЗ
	                      |							ВТ КАК ВТ)) КАК ФиксацияВесаСрезПоследних
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ФиксацияВесаСрезПоследних.Заказ) КАК ВложенныйЗапрос
	                      |		ПО ВТ.Заказ = ВложенныйЗапрос.Заказ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
	                      |		ПО ВТ.Заказ.КатегорияДоставки = КатегорииДоставки2014.Категория
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	                      |		ПО ВТ.Номер = ВозвратТоваровОтПокупателя.Номер
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			СУММА(РеализацияТоваровУслугТовары.Вес * РеализацияТоваровУслугТовары.Количество) КАК ВесПотоварный,
	                      |			РеализацияТоваровУслугТовары.Ссылка.Ссылка КАК Ссылка,
	                      |			СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма
	                      |		ИЗ
	                      |			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                      |		ГДЕ
	                      |			РеализацияТоваровУслугТовары.Ссылка.Ссылка В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Заказ
	                      |					ИЗ
	                      |						ВТ КАК ВТ)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			РеализацияТоваровУслугТовары.Ссылка.Ссылка) КАК ВложенныйЗапрос1
	                      |		ПО ВТ.Заказ = ВложенныйЗапрос1.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			КОЛИЧЕСТВО(СостоянияЗаказов.Период) КАК Поездки,
	                      |			СостоянияЗаказов.Заказ КАК Заказ
	                      |		ИЗ
	                      |			РегистрСведений.СостоянияЗаказов КАК СостоянияЗаказов
	                      |		ГДЕ
	                      |			СостоянияЗаказов.Регистратор ССЫЛКА Документ.новаОтчетВодителя
	                      |			И СостоянияЗаказов.Заказ В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Заказ
	                      |					ИЗ
	                      |						ВТ КАК ВТ)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			СостоянияЗаказов.Заказ) КАК ВложенныйЗапрос2
	                      |		ПО ВТ.Заказ = ВложенныйЗапрос2.Заказ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", РейсСсылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок = Рез.Количество();   
	ВысотаОбластей = 5;
		
	
	//Подсчет листов	
	СтраницВсего = 0; НомерСтраницы = 0;
	Если ВсегоСтрок <= 4 Тогда
		СтраницВсего = 1;
	Иначе
		ВсегоСтрок = ВсегоСтрок - 7;
		СтраницВсего = СтраницВсего + 1;
		Пока ВсегоСтрок > 0 Цикл
			Если ВсегоСтрок >= 8 Тогда
				СтраницВсего = СтраницВсего + 1;
				ВсегоСтрок = ВсегоСтрок - 8;
				Если ВсегоСтрок = 0 Тогда
					СтраницВсего = СтраницВсего + 1;	
				КонецЕсли;
			Иначе
				Если ВсегоСтрок > 5 Тогда			
					СтраницВсего = СтраницВсего + 2;					
				Иначе				
					СтраницВсего = СтраницВсего + 1;					
				КонецЕсли;	
				ВсегоСтрок = 0;
			КонецЕсли;		    					
		КонецЦикла;		
				
	КонецЕсли;
	
	
	
	НомерСтраницы = 1;	
	
	ТекВр = "" + Формат(ТекущаяДата(), "ДФ='dd-MM-yyyy HH:mm'");
	
	ОбластьКолонтитул.Параметры.ТекстСлева = "Стр." + НомерСтраницы + " из " + СтраницВсего; //нумерация страниц
	ОбластьКолонтитул.Параметры.ТекстВЦентре = "" + МаркаАвто + ", " + ГосНомер;
	ОбластьКолонтитул.Параметры.ТекстСправа = ТекВр;
	ТабличныйДокумент.Вывести(ОбластьКолонтитул);
	
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	МассивОбластей.Добавить(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьСтрокаЗаголовок);
	МассивОбластей.Добавить(ОбластьСтрокаЗаголовок);
	
	
	НуженТекст = Ложь;
	СуммаНаличные = 0;
	СуммаТерминал = 0;
	
	Пока Рез.Следующий() Цикл
		
		Если Рез.ТипЗаказа = "Д" Тогда    // --- доставка
			
			КрасимПоездки = Ложь;
			КрасимЗапреты = Ложь;
			
			ОбластьСтрока.Параметры.НПП          	= НПП;
			ОбластьСтрока.Параметры.ТипЗаказа    	= Рез.ТипЗаказа;
			ОбластьСтрока.Параметры.НомерЗаказа  	= Рез.Номер;
			ОбластьСтрока.Параметры.ВнешнийНомер 	= Рез.НомерВнешнегоЗаказа;
			ОбластьСтрока.Параметры.КолМест      	= Рез.КоличествоМест;
			
			СуммаВозврат = 0;
			Если ЗначениеЗаполнено(Рез.Возврат) Тогда
				СуммаВозврат = Рез.Возврат.Товары.Итог("Сумма");
			КонецЕсли;
			
			// МАС - 15.11.2017 - оптимизация --->> 	
			СуммаТоваров = Рез.СуммаПоТоварам;
			//НайРеализ = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(СокрЛП(Рез.Номер));
			//Если ЗначениеЗаполнено(НайРеализ) Тогда
			//	СуммаТоваров = НайРеализ.Товары.Итог("Сумма");	
			//КонецЕсли;
			// <<--- МАС
			
			// МАС - 03.08.2017 - №1456 --->> 
			//ИтоговаяСумма = СуммаТоваров - СуммаВозврат;
			ИтоговаяСумма = Рез.СуммаДокумента - СуммаВозврат;
			// <<--- МАС	
						
			//ОбластьСтрока.Параметры.Сумма        	= ?(Рез.СуммаДокумента <> 0, Рез.СуммаДокумента, СуммаВозврат);
			Если Рез.ТипОплаты = Справочники.ТипыОплат.ОплаченоВМагазине ИЛИ Рез.ТипОплаты = Справочники.ТипыОплат.БезРасчетов Тогда // Задача № 2901			
				ОбластьСтрока.Параметры.Сумма        	= 0;				
			Иначе			
				ОбластьСтрока.Параметры.Сумма        	= ?(СуммаВозврат <> 0, ИтоговаяСумма, Рез.СуммаДокумента);				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.ФСумма          = "";
			ОбластьСтрока.Параметры.Контакты	 	= "" + Рез.Грузополучатель + ", " + Рез.Телефон;	
			ОбластьСтрока.Параметры.Адрес		 	= Рез.АдресДоставки;
			
			////+++ БАО 15.08.2017 №1678 
			//Если ЗначениеЗаполнено(Рез.ВладелецТовара) И рэИнтеграцияРэдЭкспресс.ЭтоРЭД(Рез.ВладелецТовара) Тогда
			//	ОбластьСтрока.Параметры.Стриж = "РЕД";
			//Иначе
			//	ОбластьСтрока.Параметры.Стриж = "Стриж";
			//КонецЕсли;	
			////--- БАО 15.08.2017 №1678 
			
			//ОбластьСтрока.Параметры.Вес          	= МАКС(Рез.Вес, Рез.НашВес);
			//ОбластьСтрока.Параметры.Вес          	= "" + МАКС(Рез.Вес, Рез.НашВес) + Символы.ПС + Рез.КатегорияДоставки;
			
			// МАС - 16.02.2018 - № --->> 
			//ОбластьСтрока.Параметры.Вес          	= "" + МАКС(Рез.Вес, Рез.НашВес, Рез.ВесПотоварный) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.КатегорияДляРасчетаЗП), Рез.КатегорияДляРасчетаЗП.Родитель, Рез.КатегорияДоставки);
			ОбластьСтрока.Параметры.Вес1 = "";
			ОбластьСтрока.Параметры.Вес2 = "";
			//Если Рез.НашВес > 0 Тогда
			//	ОбластьСтрока.Параметры.Вес2          	= "" + МАКС(Рез.Вес, Рез.НашВес, Рез.ВесПотоварный) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.КатегорияДляРасчетаЗП), Рез.КатегорияДляРасчетаЗП.Родитель, Рез.КатегорияДоставки);
			//Иначе	
			//	//ОбластьСтрока.Параметры.Вес1          	= "" + ?(Рез.ВесПотоварный > 0, Рез.ВесПотоварный, Рез.Вес) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.КатегорияДляРасчетаЗП), Рез.КатегорияДляРасчетаЗП.Родитель, Рез.КатегорияДоставки);
			//	ОбластьСтрока.Параметры.Вес1          	= "" + МАКС(Рез.ВесПотоварный, Рез.Вес) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.КатегорияДляРасчетаЗП), Рез.КатегорияДляРасчетаЗП.Родитель, Рез.КатегорияДоставки);
			//КонецЕсли;		
			// <<--- МАС
			
			// МАС - 06.03.2018 - Теперь категория будет выводиться из МИГО --->> 
			Если Рез.НашВес > 0 Тогда
				ОбластьСтрока.Параметры.Вес2          	= "" + МАКС(Рез.Вес, Рез.НашВес, Рез.ВесПотоварный) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.КатегорияДляРасчетаЗП_Миго), Рез.КатегорияДляРасчетаЗП_Миго, Рез.КатегорияДляРасчетаЗП);
			Иначе	
				//ОбластьСтрока.Параметры.Вес1          	= "" + ?(Рез.ВесПотоварный > 0, Рез.ВесПотоварный, Рез.Вес) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.КатегорияДляРасчетаЗП), Рез.КатегорияДляРасчетаЗП.Родитель, Рез.КатегорияДоставки);
				ОбластьСтрока.Параметры.Вес1          	= "" + МАКС(Рез.ВесПотоварный, Рез.Вес) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.КатегорияДляРасчетаЗП_Миго), Рез.КатегорияДляРасчетаЗП_Миго, Рез.КатегорияДляРасчетаЗП);
			КонецЕсли;
			// <<--- МАС 
			
			
			ТелефонМагазина = Рез.Партнер.ТелефонИнтернетМагазина;
			Если Рез.Партнер.Код = "Shop_248 " ИЛИ Рез.Партнер.Код = "Shop_601 " Тогда
				ТелефонМагазина = "8-495-974-35-64";
			ИначеЕсли Рез.Партнер.Код = "Shop_438 " Тогда	
			    ТелефонМагазина = "8-499-643-33-64";
			КонецЕсли;
			
			ОбластьСтрока.Параметры.ПартнерТелефон  = "" + ?((Рез.Партнер.Код = "Shop_248 " ИЛИ Рез.Партнер.Код = "Shop_601 "), "YD", Рез.Партнер) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.Партнер), ТелефонМагазина, "");
			ОбластьСтрока.Параметры.Интервал        = "" + Рез.ИнтервалС + " - " + Рез.ИнтервалПо;
			ОбластьСтрока.Параметры.ТипОплаты       = Рез.ТипОплаты;
			
			// МАС - 31.10.2017 - № --->>  Поездки
			ОбластьСтрока.Параметры.Поездки = Строка(Рез.Поездки);
			Если Рез.Поездки >= 3 Тогда		
				КрасимПоездки = Истина		
			КонецЕсли;
			// <<--- МАС
			
			Если Рез.ТипОплаты.Код = 1 Тогда				
				СуммаНаличные = СуммаНаличные + Рез.СуммаДокумента;		
			ИначеЕсли Рез.ТипОплаты.Код = 5 Тогда		
				СуммаТерминал = СуммаТерминал + Рез.СуммаДокумента;			
			КонецЕсли;
			
			
			Если Рез.ТипОплаты.Код = 2 Тогда
				СменаОплаты = "";	
				ОбластьСтрока.Параметры.Сумма  = Рез.СуммаДокумента - Рез.ПредоплатаПоКредиту;
			ИначеЕсли Рез.ТипОплаты.Код = 4 Тогда
				СменаОплаты = "";	
				ОбластьСтрока.Параметры.Сумма  = "-";
			ИначеЕсли Рез.ТипОплаты.Код = 7 Тогда	
				СменаОплаты = "";
				ОбластьСтрока.Параметры.ФСумма = "ОПЛАЧЕНО";	
				ОбластьСтрока.Параметры.Сумма  = "-";
			Иначе					
				СменаОплаты = ?(Рез.ЗапретСменыОплаты = Истина, "Смена оплаты запрещена", "Смена оплаты разрешена");
				Если Рез.ЗапретСменыОплаты Тогда			
					КрасимЗапреты = Истина;				
				КонецЕсли;
			КонецЕсли;
			
			
			Если Рез.ТипОплаты.Код = 2 Тогда		
				ЧастичныйВыкуп = "";			
			Иначе	
				Если Рез.Партнер.Код = "Shop_602 " Тогда // Бетховен	
					ЧастичныйВыкуп = ?(Рез.Заказ.ЗапретЧастичногоВыкупа = Истина, "Частичный выкуп запрещен", "Частичный выкуп разрешен");		
					Если Рез.Заказ.ЗапретЧастичногоВыкупа Тогда		
						КрасимЗапреты = Истина;					
					КонецЕсли;
				Иначе				
					ЧастичныйВыкуп = ?(Рез.ЗапретЧастичногоВыкупа = Истина, "Частичный выкуп запрещен", "Частичный выкуп разрешен");	
					Если Рез.ЗапретЧастичногоВыкупа Тогда		
						КрасимЗапреты = Истина;					
					КонецЕсли;
				КонецЕсли;							
			КонецЕсли;
					
			
			ОбластьСтрока.Параметры.ПараметрыОплаты = ЧастичныйВыкуп + ?(СменаОплаты = "", "", ?(ЧастичныйВыкуп = "", "", Символы.ПС) + СменаОплаты)
														+ ?((Рез.Партнер.Код = "Shop_248 " ИЛИ Рез.Партнер.Код = "Shop_601 "), Символы.ПС + Рез.СОжиданием, "");		
			
														
														
			
			Если ВысотаОбластей + 10 > 34 Тогда
				ТабличныйДокумент.Вывести(ОбластьТекст);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НуженТекст = Ложь;
				НомерСтраницы = НомерСтраницы + 1;
				ОбластьКолонтитул.Параметры.ТекстСлева = "Стр." + НомерСтраницы + " из " + СтраницВсего; //нумерация страниц
				ОбластьКолонтитул.Параметры.ТекстВЦентре = "" + МаркаАвто + ", " + ГосНомер;
				ОбластьКолонтитул.Параметры.ТекстСправа = ТекВр;
				ТабличныйДокумент.Вывести(ОбластьКолонтитул);		
				
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаЗаголовок);
				ВысотаОбластей = 2;
			КонецЕсли;
			
			
						
			// >>>  Выделение фона  >>>		
			ОбластьОформленияСтроки = ТабличныйДокумент.Вывести(ОбластьСтрока);	
			Если КрасимПоездки Тогда			
				ТабличныйДокумент.Область(ОбластьОформленияСтроки.Верх, 10, ОбластьОформленияСтроки.Низ, 10).ЦветФона = Новый Цвет(213,213,213);			
			КонецЕсли;	
			Если КрасимЗапреты Тогда			
				ТабличныйДокумент.Область(ОбластьОформленияСтроки.Верх, 11, ОбластьОформленияСтроки.Низ, 11).ЦветФона = Новый Цвет(213,213,213);			
			КонецЕсли;
			// <<<  Выделение фона  <<<
			
			
			НуженТекст = Истина;
			ВысотаОбластей = ВысотаОбластей + 3;
			
					
			Если НПП = ВсегоСтрок Тогда
				ТабличныйДокумент.Вывести(ОбластьТекст);
				НуженТекст = Ложь;
				ВысотаОбластей = ВысотаОбластей + 5;
			КонецЕсли;
			
			Если ВысотаОбластей > 34 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НуженТекст = Ложь;
				НомерСтраницы = НомерСтраницы + 1;
				ОбластьКолонтитул.Параметры.ТекстСлева = "Стр." + НомерСтраницы + " из " + СтраницВсего; //нумерация страниц
				ОбластьКолонтитул.Параметры.ТекстВЦентре = "" + МаркаАвто + ", " + ГосНомер;
				ОбластьКолонтитул.Параметры.ТекстСправа = ТекВр;
				ТабличныйДокумент.Вывести(ОбластьКолонтитул);		
				
				ВысотаОбластей = 2;
			КонецЕсли;
			
			НПП = НПП + 1;
			
		ИначеЕсли Рез.ТипЗаказа = "З" Тогда // --- забор
			
			
			
			// МАС - 26.12.2017 - №2148 --->> 
			Попытка			 
				ОбъемЗ = Рез.ОбъемЗабора;		
				Если ОбъемЗ = 0 Тогда		
					ОбъемныйБрэйк = "-";
					ОбъемЗ = "";
				Иначе	
					ОбъемныйБрэйк = ПолучитьБрейкСогласноОбъемуПартнера(Рез.Заказ, ОбъемЗ);		 
				КонецЕсли;	 
			Исключение		 
			КонецПопытки;
			ОбластьЗабор.Параметры.Вес          	= "" + ОбъемЗ + Символы.ПС + ОбъемныйБрэйк;
			ОбластьЗабор.Параметры.ПараметрыОплаты  = "" + ОбъемЗ;
			ОбластьЗабор.Параметры.ТипОплаты        = "" + ОбъемныйБрэйк;
			// <<--- МАС
			
			
		    ОбластьЗабор.Параметры.НПП          	= НПП;
			ОбластьЗабор.Параметры.ТипЗаказа    	= Рез.ТипЗаказа;
			ОбластьЗабор.Параметры.НомерЗаказа  	= Рез.Номер;
			ОбластьЗабор.Параметры.ВнешнийНомер 	= Рез.НомерВнешнегоЗаказа;
			ОбластьЗабор.Параметры.КолМест      	= Рез.КоличествоМест;
			ОбластьЗабор.Параметры.Сумма       	    = "-";
			//ОбластьЗабор.Параметры.ФСумма           = "-";
			ОбластьЗабор.Параметры.Контакты	 	    = "" + Рез.Грузополучатель + ", " + Рез.Телефон;
			ОбластьЗабор.Параметры.Адрес			= Рез.АдресДоставки;
			
			////+++ БАО 15.08.2017 №1678 
			//Если ЗначениеЗаполнено(Рез.ВладелецТовара) И рэИнтеграцияРэдЭкспресс.ЭтоРЭД(Рез.ВладелецТовара) Тогда
			//	ОбластьЗабор.Параметры.Стриж = "РЕД";
			//Иначе
			//	ОбластьЗабор.Параметры.Стриж = "Стриж";
			//КонецЕсли;	
			////--- БАО 15.08.2017 №1678 

			//ОбластьЗабор.Параметры.Вес          	= "";
			//ОбластьЗабор.Параметры.Объем            = ;
			
			ТелефонМагазина = Рез.Партнер.ТелефонИнтернетМагазина;
			Если Рез.Партнер.Код = "Shop_248 " ИЛИ Рез.Партнер.Код = "Shop_601 " Тогда
				ТелефонМагазина = "8-495-974-35-64";
			ИначеЕсли Рез.Партнер.Код = "Shop_438 " Тогда	
			    ТелефонМагазина = "8-499-643-33-64";
			КонецЕсли;
			
			ОбластьЗабор.Параметры.ПартнерТелефон  = "" + ?((Рез.Партнер.Код = "Shop_248 " ИЛИ Рез.Партнер.Код = "Shop_601 "), "YD", Рез.Партнер) + Символы.ПС + ?(ЗначениеЗаполнено(Рез.Партнер), ТелефонМагазина, "");
			ОбластьЗабор.Параметры.Интервал        = "" + Рез.ИнтервалС + " - " + Рез.ИнтервалПо;
			//ОбластьЗабор.Параметры.ТипОплаты       = "";
			
			//ОбластьЗабор.Параметры.ПараметрыОплаты = "";
			
			
			// проверка влазит ли на лист		
			
			Если ВысотаОбластей + 10 > 34 Тогда
				ТабличныйДокумент.Вывести(ОбластьТекст);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НуженТекст = Ложь;
				НомерСтраницы = НомерСтраницы + 1;
				ОбластьКолонтитул.Параметры.ТекстСлева = "Стр." + НомерСтраницы + " из " + СтраницВсего; //нумерация страниц
				ОбластьКолонтитул.Параметры.ТекстВЦентре = "" + МаркаАвто + ", " + ГосНомер;
				ОбластьКолонтитул.Параметры.ТекстСправа = ТекВр;
				ТабличныйДокумент.Вывести(ОбластьКолонтитул);		
								
				ТабличныйДокумент.Вывести(ОбластьСтрокаЗаголовок);
				ВысотаОбластей = 2;
			КонецЕсли;

						
			
		    ТабличныйДокумент.Вывести(ОбластьЗабор);
			НуженТекст = Истина;
			ВысотаОбластей = ВысотаОбластей + 3;
			
			
			Если НПП = ВсегоСтрок Тогда
				ТабличныйДокумент.Вывести(ОбластьТекст);
				НуженТекст = Ложь;
				ВысотаОбластей = ВысотаОбластей + 5;
			КонецЕсли;
			
			Если ВысотаОбластей > 34 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НуженТекст = Ложь;
				НомерСтраницы = НомерСтраницы + 1;
				ОбластьКолонтитул.Параметры.ТекстСлева = "Стр." + НомерСтраницы + " из " + СтраницВсего; //нумерация страниц
				ОбластьКолонтитул.Параметры.ТекстВЦентре = "" + МаркаАвто + ", " + ГосНомер;
				ОбластьКолонтитул.Параметры.ТекстСправа = ТекВр;
				
				ТабличныйДокумент.Вывести(ОбластьКолонтитул);		
				ВысотаОбластей = 2;
			КонецЕсли;
			
			
			НПП = НПП + 1;
		КонецЕсли;	
			
	КонецЦикла;
	
	
	// подвал
	
	
	// проверка влазит ли на лист	
	//ВысотаОбластей = 2;
	
	Если НуженТекст Тогда	
		ТабличныйДокумент.Вывести(ОбластьТекст);	
		ВысотаОбластей = ВысотаОбластей + 5;
	КонецЕсли;	
	
	Если ВысотаОбластей + 10 > 34 Тогда		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		НомерСтраницы = НомерСтраницы + 1;
		ОбластьКолонтитул.Параметры.ТекстСлева = "Стр." + НомерСтраницы + " из " + СтраницВсего; //нумерация страниц
		ОбластьКолонтитул.Параметры.ТекстВЦентре = "" + МаркаАвто + ", " + ГосНомер;
		ОбластьКолонтитул.Параметры.ТекстСправа = ТекВр;
		ТабличныйДокумент.Вывести(ОбластьКолонтитул);		
		
		ВысотаОбластей = 1;
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ИтогоНаличные = СуммаНаличные;
	ОбластьПодвал.Параметры.ИтогоТерминал = СуммаТерминал;
	
	ОбластьПодвал.Параметры.НомерМаршрута = НомерМаршрута;
	ОбластьПодвал.Параметры.МаркаАвто = МаркаАвто;
	ОбластьПодвал.Параметры.ГосНомер = ГосНомер;
	ОбластьПодвал.Параметры.ДатаРейса = Формат(РейсСсылка.Дата, "ДЛФ=DD");
	ОбластьПодвал.Параметры.КолКредитныхДоговоров = КолКредитныхДоговоров;
	ОбластьПодвал.Параметры.КолБезнальныхДокументов = КолБезнальныхДокументов;
	
	//+++ БАО 25.05.2017 №900
	ОбластьПодвал.Параметры.КолЛореальВ2В = КолЛореальВ2В;	
	//--- БАО 25.05.2017 №900

		 
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
		
	
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить = Ложь;
	//ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева = "Стр." + НомерСтраницы + " из " + СтраницВсего; //нумерация страниц	
	//ТабличныйДокумент.ВерхнийКолонтитул.ТекстСправа = "" + Формат(ТекущаяДата(), "ДФ='dd-MM-yyyy HH:mm'");
	//ТабличныйДокумент.ВерхнийКолонтитул.ТекстВЦентре = "" + МаркаАвто + ", " + ГосНомер;
	
	Возврат ТабличныйДокумент;	

КонецФункции // ()


&НаСервере
Функция ПечатьМаршрутныхЛистовНаСервере()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Рейс.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.Рейс КАК Рейс
	                      |ГДЕ
	                      |	Рейс.Проведен
	                      |	И Рейс.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И Рейс.ТерминалДоставки = &ТерминалДоставки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Рейс.НомерПалетты");
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата));
	
	// МАС - 06.06.2017 - №950 --->> 
	ТекТерминал = ПараметрыСеанса.ТерминалДоставки;
	Если НЕ ЗначениеЗаполнено(ТекТерминал) Тогда	
		ТекТерминал = Справочники.РегиональныеТерминалы.МоскваСтриж;		
	КонецЕсли;
	Запрос.УстановитьПараметр("ТерминалДоставки", ТекТерминал);
	// <<--- МАС 
	
	
	//Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата("20160815")));
	//Запрос.УстановитьПараметр("Дата2", КонецДня(Дата("20160815")));
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		//may.ОтправитьСМСПоРейсу(Рез.Ссылка);
		may.РаспечаткаМаршрутногоЛиста(Рез.Ссылка, Ложь);
		ТабличныйДокумент = ПечатьМаршрутногоЛистаСервер(Рез.Ссылка, ТабличныйДокумент);	
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		may.РаспечаткаМаршрутногоЛиста(Рез.Ссылка, Истина);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции



Функция ПолучитьБрейкСогласноОбъемуПартнера(Забор,ОбъемФ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъемныеБрейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОбъемныеБрейки КАК ОбъемныеБрейки
		|ГДЕ
		|	ОбъемныеБрейки.Владелец = &Владелец
		|	И ОбъемныеБрейки.ОбъемОт <= &Объем
		|	И ОбъемныеБрейки.ОбъемДо >= &Объем";

	Запрос.УстановитьПараметр("Объем", ОбъемФ);
	Запрос.УстановитьПараметр("Владелец", Забор.ТарифнаяСетка);

	РезМ = Запрос.Выполнить().Выбрать();
	Пока РезМ.Следующий() Цикл
		Возврат РезМ.Ссылка;
	КонецЦикла;		
	Возврат Неопределено;
КонецФункции
